# Trunc

## Description
Truncates the decimal portion of the specified REAL number, returning the result as a LONGINT value.

Note that direct assignment of a REAL to a LONGINT will result in rounding the REAL to the ''nearest'' LONGINT, whereas Trunc always ''rounds down'' (if the number is positive).

```pascal
FUNCTION Trunc(v : REAL): LONGINT;
```

```python
def vs.Trunc(v):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|v|REAL|Real value to truncate.|

## Remarks
\_c\_, 2015.05.23: Pay attention when using Trunc with very large numbers exceeding the Longint limit: [http://en.wikipedia.org/wiki/2147483647 2147483647]].

```pascal
num :=  1000000000000.23456789; { a very large number }
AlrtDialog(Concat(num)); { --> 1000000000000.23 loss of digits }
AlrtDialog(Concat('prec 2: ', Num2Str(2, num) )); { --> 1000000000000.23  OK }
AlrtDialog(Concat('prec -1: ', Num2Str(-1, num) )); { --> 1,0000000000e+12  OK }
AlrtDialog(Concat('prec -2: ', Num2Str(-2, num) )); { --> 1,00000000000235e+12  OK }
AlrtDialog(Concat('prec -3: ', Num2Str(-3, num) )); { --> empty! }
AlrtDialog(Concat('prec -4: ', Num2Str(-4, num) )); { --> empty! }

AlrtDialog(Concat('Trunc: ', Trunc(num) )); { --> 2147483647 fully wrong }
));
 ```

## Examples
#### VectorScript ####
```pascal
Trunc(235.04); { returns 235 }
Trunc(235.94); { returns 235 }
Trunc(0.94); { returns 0 }
```
#### Python ####
```python

```

```pascal
BEGIN
	degrees    := Trunc(inAngle);
	tmpDecimal := inAngle - degrees;
	minutes    := Trunc(tmpDecimal * 60.0);
	tmpDecimal := (tmpDecimal * 60.0) - minutes;
	seconds    := Round(tmpDecimal * 60.0);

BEGIN
NumSlats := Trunc(abs(SLength)/kSlatWidth);
SlatWidth := Abs(SLength)/NumSlats;
NumSlats := NumSlats-1;
CASE Arch OF
	4,5 :

n := -1;
REPEAT
	n := n + 1;
	a0 := a * 10^n;
	frac := a0 - Trunc (a0);
UNTIL (frac < 1e-10) OR (n = 9);
numPlaces := n;
```
```python
if sweepTmp > 90:
	n = vs.Trunc( sweep2D / 90.00001 )
	i = 1
	while (i <= n ):
		# Draw road bed
		DrawParallelArcs( vs.PRadius - vs.PWidth / 2, 90, vs.PWidth, gPaving_Class )
```

## Version
Availability: from All Versions

## Category
* Math - General